driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/XSDVariables_Complex_Expressions3/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:SampleXSD">
  <soapenv:Body>
    <urn:Item>
      <value>99999</value>
    </urn:Item>
  </soapenv:Body>
</soapenv:Envelope>